JShop/app/models/user.rb

  def validate_username
    if User.where(email: username).exists?
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tanchiachun"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (lower(username) = 'tanchiachun' OR lower(email) = 'tanchiachun') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]