JShop/app/views/home/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                                            <div class="d-flex flex-column">
                                                <% @buyer = User.find_by(id: waiting_s_order.user_id) %>