JShop/app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @random_products = Product.all.sample(10)
    @ranked_products = (Product.all.sort_by &:sales).first(10)