JShop/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "description", "added_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Water"], ["price", 5], ["description", "Pure water."], ["added_time", 2021], ["created_at", "2021-12-22 19:51:55.150722"], ["updated_at", "2021-12-22 19:51:55.150722"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2021-12-22 19:51:55.168354"], ["id", 2]]